---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsFBXExportAvailable
source: html/4b97cd38-b83e-70fa-9a9d-46bd8bc997ad.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsFBXExportAvailable Method

Checks whether the FBX Export functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsFBXExportAvailable()
```

## Returns
True if the FBX Export functionality is available in the installed Revit.

## Remarks
FBX Export requires presence of certain modules that are optional and may not be part of the installed Revit.